ACantabile/OS/AppLib/STM32F10X_USART_FD.C
/****************************Copyright (c)**********************************************                                     
**
**                     温州大学智能电子电器重点实验室
**
**
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: Usart.c
** 创 建 人: 陈冲
** 创建日期: 2009年03月19日
** 描    述: 串口驱动程序
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0	 
** 日    期: 2009年03月19日	
** 描    述: 串口初始化函数，中断函数，通过串口数据结构指针操作不同的串口
**           
**           
**------------- 修改信息 ---------------------------------------------------------------

**--------------------------------------------------------------------------------------
** 备    注: 从模式时需在1MS定时中断是加入如下代码:
****************************************************************************************/

#define STM32F10X_USART_FD_MAIN
#include "STM32F10X_USART_FD.H"
//--------------------------------------------------------------------------------------
//版本号管理
#define STM32F10X_USART_VER_C 100

	#if STM32F10X_USART_VER_C != STM32F10X_USART_VER_H
		#ERROR "STM32F10X_USART_C_VER ERROR!"
	#endif
//--------------------------------------------------------------------------------------

#include "string.h"

#define USART_SR	0x00	//状态寄存器
	enum{
		B_USART_SR_PE,
		B_USART_SR_FE,
		B_USART_SR_NE,
		B_USART_SR_ORE,
		B_USART_SR_IDLE,
		B_USART_SR_RXNE,
		B_USART_SR_TC,
		B_USART_SR_TXE,
		B_USART_SR_LBD,
		B_USART_SR_CTS
	};

#define USART_DR	0x04	//数据寄存器
#define USART_BRR	0x08	//波特率寄存器
#define USART_CR1	0x0c	//控制寄存器1
	enum{
		B_USART_CR1_SBK,
		B_USART_CR1_RWU,
		B_USART_CR1_RE,
		B_USART_CR1_TE,
		B_USART_CR1_IDLEIE,
		B_USART_CR1_RXNEIE,
		B_USART_CR1_TCIE,
		B_USART_CR1_TXEIE,
		B_USART_CR1_PEIE,
		B_USART_CR1_PS,
		B_USART_CR1_PCE,
		B_USART_CR1_WAKE,
		B_USART_CR1_M,
		B_USART_CR1_UE
	};
#define USART_CR2	0x10	//控制寄存器2
#define USART_CR3	0x14	//控制寄存器3
#define USART_GTPR	0x18	//保护时间及与分频器



//通讯插入到定时器的程序
u8 usart_tm_1mS(USART_T *p)
{
	u8 r=0;
	if(p->tm_1mS!=0 && --p->tm_1mS==0)
	{
		if(p->adr==0 || TstB(p->sta,B_USART_ADR_OK))
		{
			//!禁止继续接收
			//U32_ClrB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_RE);	//禁止接收
			U8_SetB(&p->sta,B_EV_USART_RX);			//置接收标志
			//U8_ClrB(&p->sta,B_USART_ADR_OK);
			r=1;
		}
		else
		{
			p->r_e=0;		//地址不对,马上启动新的接收
		}
	}
	return(r);
	/*
	if(p->tm_send!=0)
	{
		if(--(p->tm_send)==0)
		{
			U32_SetB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_TXEIE);//开启TXE中断
		}
	}
	
	if(p->tm_485!=0)
	{
		if(--(p->tm_485)==0)
		{
			HWREG(p->RS485)=~p->sta;	//切换RS485到接受状态
		}
	}
	*/
}

//通讯中断服务函数
//
#define COMM_STA_ERR_BIT ((1<<B_USART_SR_FE) | (1<<B_USART_SR_PE))
//#define COMM_STA_ERR_BIT ((1<<B_USART_SR_FE))
void usart_isr(USART_T *p)
{
	unsigned long base;
	unsigned long i;
	unsigned long j;
	unsigned char ch;
	unsigned short n;
	
	base=p->base;

	i=HWREG(base+USART_SR); 
	j= HWREG(base+USART_CR1);		//读取状态
	
	//if(p->baud_sta & (1<<B_USART_BAUD_LOCK))
	{
		j |= COMM_STA_ERR_BIT;
	}
	i&=j;

	if(TstB(i,B_USART_SR_RXNE))
	{	//接收数据
		ch=HWREG(base+USART_DR);	//先读,有帧错误的时候可以清除标志
		
//		r_e=p->r_e;
//		if(r_e==0 || (i & COMM_STA_ERR_BIT)==0)
//		{
//			if(r_e<p->rx_buf_len)
//			{	
//				p->rx_buf[r_e]=ch;
//				if(r_e==0)
//				{
//					if(ch==p->adr || ch==0)
//					{
//						U8_SetB(&(p->sta),B_USART_ADR_OK);
//					}
//				}
//				p->r_e++;
//			}
//		p->tm_1mS=p->tm_1mS_init;
//		}
		//n=(p->r_e-p->r_s)%(p->rx_buf_len);	//求缓冲区已经存在的字节数
		//n %= (p->rx_buf_len);	//求缓冲区已经存在的字节数
		
		n=((unsigned int)(p->r_e) + (unsigned int)(p->rx_buf_len) - (unsigned int)(p->r_s)) % (unsigned int)(p->rx_buf_len);
		
		
		if(n==0 || (i & COMM_STA_ERR_BIT)==0)
		{									//收到第一个字节或者有帧错误，帧错误一般用于波特率自适应
			if((n+1) < p->rx_buf_len)
			{								//小于缓冲区
				p->rx_buf[p->r_e]=ch;		//接收一个字节
				if(TstB(p->sta,B_USART_CHKADR) && n==0)
				{							//需要判断第一个地址，第一个字节判断一下地址
					if(ch==p->adr || ch==0)
					{
						U8_SetB(&(p->sta),B_USART_ADR_OK);	//设地址匹配标志
					}
				}
				//p->r_e=(++p->r_e)%(p->rx_buf_len);			//对尾指针增量
				j=p->r_e+1;
				j %= (p->rx_buf_len);			//对尾指针增量
				p->r_e=j;						//一次性赋值
			}
		p->tm_1mS=p->tm_1mS_init;							//设超时寄存器
		}
	}
	//--------------------------------------------------------------------------------------------
	if(TstB(i,B_USART_SR_TXE))
	{								//发送寄存器空中断
		if(p->t_s!=p->t_e) 
		{
			HWREG(base+USART_DR)=p->tx_buf[p->t_s];	//发送字节
			//p->t_s++;
			//p->t_s=(++p->t_s)%p->tx_buf_len;		//发送首指针增量
			j=p->t_s+1;
			j %= (p->tx_buf_len);
			p->t_s=j;
		}
		else
		{	//最后一个字节移入发送寄存器
			U32_ClrB((unsigned long*)(base+USART_CR1),B_USART_CR1_TXEIE);//禁止TXE中断
			U32_SetB((unsigned long*)(base+USART_CR1),B_USART_CR1_TCIE);//允许TC中断
		}
	}
	else if(TstB(i,B_USART_SR_TC))
	{								//发送移位寄存器空，完全发送完毕
		//HWREG(p->RS485)=~p->sta;	//切换RS485到接收状态
		HWREGH(p->RS485_GPIO_RECV)=p->RS485_PIN;		//切换485至接收状态
		
		U8_ClrB(&(p->sta),B_USART_TX_BUSY);			//清除发送忙标志
		U32_ClrB((unsigned long*)(base+USART_CR1),B_USART_CR1_TCIE);//禁止TC中断
		U32_SetB((unsigned long*)(base+USART_CR1),B_USART_CR1_RE);	//与半双工兼容，每次发送完成允许接收
	}
}
//-------------------------------------------------------------------------------
//清零接收指针，切换为RSP85接收状态，允许接收
void usart_rx_rst(USART_T *p)
{
	p->r_s=0;
	p->r_e=0;
	HWREGH(p->RS485_GPIO_RECV)=p->RS485_PIN;
	U32_ClrB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_TCIE);//禁止TC中断
	U32_SetB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_RE);	//允许接收
}

void usart_rx_en(USART_T *p)
{
	HWREGH(p->RS485_GPIO_RECV)=p->RS485_PIN;
	U32_ClrB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_TCIE);//禁止TC中断
	U32_SetB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_RE);	//允许接收
}

void usart_rx_clr(USART_T *p)
{
	p->r_s=0;
	p->r_e=0;
	U8_ClrB(&(p->sta),B_EV_USART_RX);
}

//-------------------------------------------------------------------------------


//兼容半双工发送函数
//启动发送函数，调用函数前必须填充好发送缓冲区
void usart_hd_send_start(USART_T *pu,unsigned short n)
{
	if(n!=0)
	{
		U8_SetB(&(pu->sta),B_USART_TX_BUSY);
		pu->t_s=0;		//半双工，每次清零
		pu->t_e=n;
		
		HWREGH(pu->RS485_GPIO_SEND)=pu->RS485_PIN;		//RS485端口指向发送状态	
		U32_ClrB((unsigned long*)(pu->base+USART_CR1),B_USART_CR1_RE);		//半双工发送时禁止接收
		pu->r_s=0;		//半双工对接收清零
		pu->r_e=0;		//半双工对接收清零
		U32_SetB((unsigned long*)(pu->base+USART_CR1),B_USART_CR1_TXEIE);//允许TXE中断
	}
}
//-------------------------------------------------------------------------------


//从接收缓冲区读取数据,最多n个
int usart_buf(USART_T *p,unsigned char *buf,unsigned short n,unsigned char b_move)
{
	unsigned int head,tail,head_end,rn,len;
	
	if(n==0)
	{
		return(0);
	}
	
	head=p->r_s;
	tail=p->r_e;
	len=p->rx_buf_len;
	
	//rn=(tail-head)%(p->rx_buf_len);	//short编译会出错,换成int
	//rn=(tail-head)%len;		//求出目前接收到的字节数
	head_end = len - head;		//求头到最后的字节数
	rn=( tail + head_end ) % len;		//求出目前接收到的字节数
		
	if(rn>0)
	{						//有数据
		if(rn > n)
		{					//数据量大于接收的数据n，只接收n个
			rn=n;
			tail=(head+rn)%len;		//重新计算尾部！防止后面出错
		}
		
		if(tail > head)
		{							//尾比头大，数据在连续区，直接拷贝
			memcpy(buf,p->rx_buf+head,rn);
		}
		else
		{							//尾比头小，没有头尾相等状态
			//head_end=len-head;		//求头到最后的字节数
			memcpy(buf,p->rx_buf+head,head_end);	//拷贝头到最后的字节
			memcpy(buf+head_end,p->rx_buf,rn-head_end);	//拷贝剩下的字节
			
