ACantabile/OS/AppLib/STM32F10X_USART_FD.C
		}
		if(b_move)
		{							//如果删除接收缓冲区的内容，调整头指针
			p->r_s=(head + rn) % len;
		}
	}
	return(rn);
}
	
//从接收缓冲区读取数据,最多n个	
int usart_recv(USART_T *p,unsigned char *buf,unsigned short n)
{
	return(usart_buf(p,buf,n,1));
}

//从接收缓冲区拷贝数据,最多n个
int usart_copy(USART_T *p,unsigned char *buf,unsigned short n)
{
	return(usart_buf(p,buf,n,0));
}

//求接收缓冲区已经接收的字节数
unsigned int usart_recv_bytes(USART_T *p)
{
	unsigned int i;
	i=(unsigned int)(p->r_e) + (unsigned int)(p->rx_buf_len) - (unsigned int)(p->r_s);
	return(i % p->rx_buf_len);
}

//从接收缓冲区删除n个数据
unsigned int usart_rbuf_erase(USART_T *p,unsigned short n)
{
	unsigned int head,tail,rn,len;
	head=p->r_s;
	tail=p->r_e;
	len=p->rx_buf_len;
	
	rn=(tail + len - head) % len;		//求出目前接收到的字节数
	
	if(n > rn)
	{
		n=rn;
	}
	
	p->r_s=(head + n) % len;
	return(n);
}

//向通讯缓冲区填入字节，并启动发送
//p:通讯结构体指针
//buf:要发送字节的指针
//n：要发送的字节数
//返回：发送成功的字节数，由于通讯口剩余空间有可能比要发送的字节数小，返回的字节数小于等于n
int usart_send(USART_T *p,unsigned char *buf,unsigned short n)
{
	unsigned int tn,head,tail,tail_end,len;
	
	if(n>0)
	{
		if(buf == p->tx_buf)		//通讯发送缓冲区直接作为工作缓冲区
		{
			p->t_s=0;
			p->t_e=0;
		}
		
		head=p->t_s;
		tail=p->t_e;
		len=p->tx_buf_len;
		
		
		tail_end = len - tail;						//求尾到最后的空间
		tn=(head + tail_end) % len;		//求出缓冲区剩下的空间
		
		if(tn==0)
		{
			tn=len;		//缓冲区空
		}
		
		tn--;			//区别缓冲区空与缓冲区满，实际空间减少一个
		
		if(n > tn)
		{
			n=tn;		//如果要求发送的内容超过缓冲区剩余的空间，则发送剩余空间大小的字节数
		}
		
		if(n!=0)
		{
			U8_SetB(&(p->sta),B_USART_TX_BUSY);			//切换成忙状态
			HWREGH(p->RS485_GPIO_SEND)=p->RS485_PIN;		//RS485端口指向发送状态	
			
			if(buf != p->tx_buf)
			{
				if(head > tail)
				{
					memcpy(p->tx_buf+tail,buf,n);			//头大于尾，剩余空间在连续区域
				}
				else
				{
					//tail_end=len-tail;						//求尾到最后的空间
					if(tail_end>=n)
					{
						memcpy(p->tx_buf+tail,buf,n);		//比n大，这段连续空间直接拷贝
					}
					else
					{
						memcpy(p->tx_buf+tail,buf,tail_end);		//先拷贝尾到最后的字节数
						memcpy(p->tx_buf,buf+tail_end,n-tail_end);	//再拷贝剩下的字节数
					}
				}
			}
			p->t_e=(tail + n) % len;		//调整尾指针

			U32_SetB((unsigned long*)(p->base+USART_CR1),B_USART_CR1_TXEIE);//允许TXE中断
		}
		return(n);		//返回发送字节数
	}
	else
	{		
		return(0);
	}
}



//==============================================================================
/*
const u16 tb_usart_wl[]={USART_WordLength_8b,USART_WordLength_9b};
const u16 tb_usart_pi[]={USART_Parity_No,USART_Parity_Even,USART_Parity_Odd};
const u16 tb_usart_st[]={USART_StopBits_1,USART_StopBits_0_5,USART_StopBits_2,USART_StopBits_1_5};


//打开串口函数，使用FIFO，接收6/8，发送4/8，使能中断
//int Open_USART(unsigned long ulComm,unsigned long ulBaud,unsigned long ulConfig,
//			  GPIO_TypeDef * RS485_GPIO_BASE,unsigned long RS485_BIT,unsigned char INT_PI)
USART_T* Open_USART(USART_INIT_T *pinit)
{
	USART_InitTypeDef USART_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;	//定义GOIP配置结构体
	NVIC_InitTypeDef NVIC_InitStructure;	//定义中断配置结构体
	USART_TypeDef * USART;
	u8 USART_IRQChannel;
	u16 GPIO_RX_PIN,GPIO_TX_PIN;
	GPIO_TypeDef * USART_GPIO;
	u16 i;
	u32 map_r;
	u32 RCC_APB2Periph;
	unsigned char ulComm;
	unsigned long ulBaud;
	unsigned long ulConfig;
	GPIO_TypeDef * RS485_GPIO_BASE;
	


	USART_T *p=NULL;
	
	//map_r=AFIO->MAPR;
	ulComm=pinit->ulComm;
	ulBaud=pinit->ulBaud;
	ulConfig=pinit->ulConfig;

	if(ulComm==1)
	{
		USART=USART1;
		
		
		if((map_r & GPIO_Remap_USART1)==GPIO_Remap_USART1)
		{
			USART_GPIO=GPIOB;			//重映射至PB6,7
			GPIO_RX_PIN=GPIO_Pin_7;
			GPIO_TX_PIN=GPIO_Pin_6;
			RCC_APB2Periph=	RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO;

		}
		else
		{
			USART_GPIO=GPIOA;
			GPIO_RX_PIN=GPIO_Pin_10;
			GPIO_TX_PIN=GPIO_Pin_9;
			RCC_APB2Periph=	RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO;
		}
		USART_IRQChannel=USART1_IRQn;	//USART1_IRQChannel;

		g_USART[0].base=USART1_BASE;
		p=&g_USART[0];	
		//--------------------------------------------------	
	}
	else if(ulComm==2)
	{
		// 使能UART1外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);	
		//-------------------------------------------------
		USART=USART2;
		
		if((map_r & GPIO_Remap_USART2) == GPIO_Remap_USART2)
		{
			USART_GPIO=GPIOD;			//重映射至PD5,6
			GPIO_RX_PIN=GPIO_Pin_6;
			GPIO_TX_PIN=GPIO_Pin_5;
			RCC_APB2Periph=RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;
		}
		else
		{
			USART_GPIO=GPIOA;
			GPIO_RX_PIN=GPIO_Pin_3;
			GPIO_TX_PIN=GPIO_Pin_2;
			RCC_APB2Periph=RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO;
		}
		
		USART_IRQChannel=USART2_IRQn;	//USART2_IRQChannel;

		g_USART[1].base=USART2_BASE;
		p=&g_USART[1];
		//--------------------------------------------------	
	}
	else if(ulComm==3)
	{
		// 使能UART1外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);	
		//-------------------------------------------------
		USART=USART3;
		
		map_r&=GPIO_FullRemap_USART3;
		if(map_r == GPIO_FullRemap_USART3)
		{
			USART_GPIO=GPIOD;			//全映射,至PD8,9
			GPIO_RX_PIN=GPIO_Pin_9;
			GPIO_TX_PIN=GPIO_Pin_8;
			RCC_APB2Periph=RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;
		}
		else if(map_r==GPIO_PartialRemap_USART3)
		{
			USART_GPIO=GPIOC;			//部分映射,至PC10,11
			GPIO_RX_PIN=GPIO_Pin_11;
			GPIO_TX_PIN=GPIO_Pin_10;
			RCC_APB2Periph=RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO;
		}
		else
		{
			USART_GPIO=GPIOB;
			GPIO_RX_PIN=GPIO_Pin_11;
			GPIO_TX_PIN=GPIO_Pin_10;
			RCC_APB2Periph=RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO;
		}
		
		USART_IRQChannel=USART3_IRQn;	//USART3_IRQChannel;

		g_USART[2].base=USART3_BASE;
		p=&g_USART[2];
		//--------------------------------------------------
	}
#if USART_N >3
	else if(ulComm==4)
	{
		// 使能UART4外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);	
		//-------------------------------------------------
		USART=UART4;
		
		
		USART_GPIO=GPIOC;
		GPIO_RX_PIN=GPIO_Pin_11;
		GPIO_TX_PIN=GPIO_Pin_10;
		RCC_APB2Periph=RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO;
		
		
		USART_IRQChannel=UART4_IRQn;	//USART3_IRQChannel;

		g_USART[3].base=UART4_BASE;
		p=&g_USART[3];
		//--------------------------------------------------
	}
	else if(ulComm==5)		//串口5 TX-PC12，RX-PD2
	{
		// 使能UART5外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);	
		//-------------------------------------------------
		USART=UART5;
				
		USART_GPIO=GPIOD;
		GPIO_RX_PIN=GPIO_Pin_2;		//PD2
		
		GPIO_TX_PIN=GPIO_Pin_12;	//PC12
		RCC_APB2Periph=RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;
		
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO , ENABLE);	//com5 开PC
		
		USART_IRQChannel=UART5_IRQn;	//USART3_IRQChannel;

