ACantabile/OS/AppLib/STM32F10X_USART_FD.C
		g_USART[4].base=UART5_BASE;
		p=&g_USART[4];
		//--------------------------------------------------
	}
#endif
	else
	{
		return(p);
	}
	//--------------------------------------------------------------------------
	RCC_APB2PeriphClockCmd(RCC_APB2Periph, ENABLE);
	p->rx_buf=pinit->rx_buf;
	p->rx_buf_len=pinit->rx_buf_len;
	p->tx_buf=pinit->tx_buf;
	p->tx_buf_len=pinit->tx_buf_len;
	//--------------------------------------------------------------------------

	i= ulConfig;

	//配置输入GPIO
	// Configure USART1 Rx (PA.10) as input floating 
	GPIO_InitStructure.GPIO_Pin = GPIO_RX_PIN;
	if(i & USART_RX_INF)
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	}
	else
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;  	//默认
	}
	GPIO_Init(USART_GPIO, &GPIO_InitStructure);
	
	//配置输出端口
	GPIO_InitStructure.GPIO_Pin = GPIO_TX_PIN ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	if(i & USART_TX_OD)
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;	
	}
	else
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;	//默认
	}
	if(ulComm==5)
	{
		GPIO_Init(GPIOC, &GPIO_InitStructure);	//串口5 TX-PC12，RX-PD2
	}
	else
	{
		GPIO_Init(USART_GPIO, &GPIO_InitStructure);
	}

	i >>= USART_CFG_RRN;
	//p->sta=i & 0x01;	//配置RS485极性
	//HWREG(p->RS485)=~p->sta;

	//配置RS485端口
	RS485_GPIO_BASE=pinit->RS485_GPIO_BASE;
	if(RS485_GPIO_BASE==0)
	{
		//p->RS485=REG_BIT(&(p->sta),B_USART_SRS485);//指向端口或指向结构sta的位
		p->RS485_GPIO_SEND=&p->RS485_SOFT;
		p->RS485_GPIO_RECV=&p->RS485_SOFT;
	}
	else
	{
		p->RS485_PIN=1 << pinit->RS485_GPIO_PIN;
		GPIO_InitStructure.GPIO_Pin = p->RS485_PIN;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;	//推挽输出
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//快速模式输出
		GPIO_Init(pinit->RS485_GPIO_BASE, &GPIO_InitStructure);
		
		//p->RS485=REG_BIT(((u32)RS485_GPIO_BASE+GPIO_ODR),RS485_BIT);
		if(i & 0x01)
		{	//RS485高电平发送
			p->RS485_GPIO_SEND=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BSRR);
			p->RS485_GPIO_RECV=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BRR);
		}
		else
		{	//RS485低电平发送
			p->RS485_GPIO_SEND=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BRR);
			p->RS485_GPIO_RECV=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BSRR);
		}
		*(p->RS485_GPIO_RECV)=p->RS485_PIN;		//初始化后切为接收状态
	}
	//-------------------------------------------------------------------------
	if(pinit->ulConfig & USART_CFG_FD)
	{
		p->sta |= 1<<B_USART_FD;				//全双工标志
	}
	//-------------------------------------------------------------------------
	//初始化串行端口
	if(ulBaud==BAUD_USE_NB)
	{
		if(p->baud_nb>=BAUD_NB_MAX)p->baud_nb=0;
		ulBaud=Tb_BaudRate[p->baud_nb];
	}
	USART_InitStructure.USART_BaudRate = ulBaud;

	Set_Usart_Tout_1mS(p,ulBaud);
	
	

	//---------------------------------------------------------------------

	i >>= USART_CFG_RRN;
	USART_InitStructure.USART_WordLength = tb_usart_wl[i & USART_CFG_MASK];

	i >>= USART_CFG_RRN;
	USART_InitStructure.USART_Parity = tb_usart_pi[i & USART_CFG_MASK];

	i >>= USART_CFG_RRN;
	USART_InitStructure.USART_StopBits = tb_usart_st[i & USART_CFG_MASK];

	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	
	USART_Init(USART, &USART_InitStructure);	//配置端口

	USART_ITConfig(USART, USART_IT_RXNE, ENABLE);	//使能中断
	
	USART_Cmd(USART, ENABLE);	//使能端口
	//-----------------------------------------------------------
	//使能中断
	NVIC_InitStructure.NVIC_IRQChannel = USART_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = pinit->INT_PI & 0x0f;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	//------------------------------------------------------------
	return(p);	
}
*/
//配置字符串"数据位，校验位，停止位，半双工/全双工，输出PP或OD，输入上拉或悬空，中断优先级，RS485DPIO，RS485PIN，RS485极性"
//CfgStr:"7/8,n/e/o,1/2,p/o,u/f,0-15,A-F,0-15,P/N"

typedef struct{
	char comm_port;
	char data_bits;
	char parity;
	char stop_bits;
	char hf_mode;
	char tx_port_mode;
	char rx_port_mode;
	char interrupt;
	char RS485_GPIO_BASE;
	char RS485_GPIO_PIN;
	char RS485_PORT_MODE;
	char RS485_GPIO_polarity;
} USART_CFGSTR_T;



USART_T* Open_USART(const char *cfg_str,unsigned int ulBaud,unsigned short tx_buf_size,unsigned int rx_buf_size)
{
	USART_InitTypeDef USART_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;	//定义GOIP配置结构体
	NVIC_InitTypeDef NVIC_InitStructure;	//定义中断配置结构体
	USART_TypeDef * USART;
	u8 USART_IRQChannel;
	u16 GPIO_RX_PIN,GPIO_TX_PIN;
	GPIO_TypeDef * USART_GPIO;
	int i;
	u32 map_r;
	u32 RCC_APB2Periph;

	GPIO_TypeDef * RS485_GPIO_BASE;
	USART_CFGSTR_T CFG;
	
	//------------------------------------------------------------
	
	USART_T *p=NULL;
	
	if(strlen(cfg_str)!=sizeof(USART_CFGSTR_T))
	{
		return(NULL);
	}
	
	memcpy(&CFG,cfg_str,sizeof(CFG));
	str2lwr((char *)&CFG);
		
	i=CFG.comm_port;

	map_r=AFIO->MAPR;
	if(i=='1')
	{
		USART=USART1;
		
		if((map_r & GPIO_Remap_USART1)==GPIO_Remap_USART1)
		{
			USART_GPIO=GPIOB;			//重映射至PB6,7
			GPIO_RX_PIN=GPIO_Pin_7;
			GPIO_TX_PIN=GPIO_Pin_6;
			RCC_APB2Periph=	RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO;

		}
		else
		{
			USART_GPIO=GPIOA;
			GPIO_RX_PIN=GPIO_Pin_10;
			GPIO_TX_PIN=GPIO_Pin_9;
			RCC_APB2Periph=	RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO;
		}
		USART_IRQChannel=USART1_IRQn;	//USART1_IRQChannel;

		g_USART[0].base=USART1_BASE;
		p=&g_USART[0];	
		//--------------------------------------------------	
	}
	else if(i=='2')
	{
		// 使能UART1外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);	
		//-------------------------------------------------
		USART=USART2;
		
		if((map_r & GPIO_Remap_USART2) == GPIO_Remap_USART2)
		{
			USART_GPIO=GPIOD;			//重映射至PD5,6
			GPIO_RX_PIN=GPIO_Pin_6;
			GPIO_TX_PIN=GPIO_Pin_5;
			RCC_APB2Periph=RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;
		}
		else
		{
			USART_GPIO=GPIOA;
			GPIO_RX_PIN=GPIO_Pin_3;
			GPIO_TX_PIN=GPIO_Pin_2;
			RCC_APB2Periph=RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO;
		}
		
		USART_IRQChannel=USART2_IRQn;	//USART2_IRQChannel;

