ACantabile/OS/AppLib/STM32F10X_USART_FD.C
		g_USART[1].base=USART2_BASE;
		p=&g_USART[1];
		//--------------------------------------------------	
	}
#if USART_N >2
	else if(i=='3')
	{
		// 使能UART1外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);	
		//-------------------------------------------------
		USART=USART3;
		
		map_r&=GPIO_FullRemap_USART3;
		if(map_r == GPIO_FullRemap_USART3)
		{
			USART_GPIO=GPIOD;			//全映射,至PD8,9
			GPIO_RX_PIN=GPIO_Pin_9;
			GPIO_TX_PIN=GPIO_Pin_8;
			RCC_APB2Periph=RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;
		}
		else if(map_r==GPIO_PartialRemap_USART3)
		{
			USART_GPIO=GPIOC;			//部分映射,至PC10,11
			GPIO_RX_PIN=GPIO_Pin_11;
			GPIO_TX_PIN=GPIO_Pin_10;
			RCC_APB2Periph=RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO;
		}
		else
		{
			USART_GPIO=GPIOB;
			GPIO_RX_PIN=GPIO_Pin_11;
			GPIO_TX_PIN=GPIO_Pin_10;
			RCC_APB2Periph=RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO;
		}
		
		USART_IRQChannel=USART3_IRQn;	//USART3_IRQChannel;

		g_USART[2].base=USART3_BASE;
		p=&g_USART[2];
		//--------------------------------------------------
	}
#endif
#if USART_N >3
	else if(i=='4')
	{
		// 使能UART4外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);	
		//-------------------------------------------------
		USART=UART4;
		
		
		USART_GPIO=GPIOC;
		GPIO_RX_PIN=GPIO_Pin_11;
		GPIO_TX_PIN=GPIO_Pin_10;
		RCC_APB2Periph=RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO;
		
		
		USART_IRQChannel=UART4_IRQn;	//USART3_IRQChannel;

		g_USART[3].base=UART4_BASE;
		p=&g_USART[3];
		//--------------------------------------------------
	}
	else if(i=='5')		//串口5 TX-PC12，RX-PD2
	{
		// 使能UART5外设
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);	
		//-------------------------------------------------
		USART=UART5;
				
		USART_GPIO=GPIOD;
		GPIO_RX_PIN=GPIO_Pin_2;		//PD2
		
		GPIO_TX_PIN=GPIO_Pin_12;	//PC12
		RCC_APB2Periph=RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;
		
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO , ENABLE);	//com5 开PC
		
		USART_IRQChannel=UART5_IRQn;	//USART3_IRQChannel;

		g_USART[4].base=UART5_BASE;
		p=&g_USART[4];
		//--------------------------------------------------
	}
#endif
	else
	{
		return(NULL);
	}
	//--------------------------------------------------------------------------
	RCC_APB2PeriphClockCmd(RCC_APB2Periph, ENABLE);
	//--------------------------------------------------------------------------
	p->rx_buf_len=rx_buf_size;
	p->rx_buf=DataPool_Get(rx_buf_size);
	if(p->rx_buf == NULL)
	{
		return(NULL);
	}
	
	if(CFG.hf_mode=='h')
	{
		p->tx_buf=p->rx_buf;
		p->tx_buf_len=rx_buf_size;
	}
	else if(CFG.hf_mode=='f')
	{
		p->tx_buf_len=tx_buf_size;
		p->tx_buf=DataPool_Get(tx_buf_size);
		p->sta |= 1<<B_USART_FD;				//全双工标志
		if(p->tx_buf==NULL)
		{
			return(NULL);
		}
	}
	else
	{
		return(NULL);
	}
	//--------------------------------------------------------------------------
	//配置输入TX，RX 的GPIO
	GPIO_InitStructure.GPIO_Pin = GPIO_RX_PIN;
	if(CFG.rx_port_mode=='f')
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	}
	else if(CFG.rx_port_mode=='u')
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;  	//默认
	}
	else
	{
		return(NULL);
	}
	GPIO_Init(USART_GPIO, &GPIO_InitStructure);
	
	//配置输出端口
	GPIO_InitStructure.GPIO_Pin = GPIO_TX_PIN ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	if(CFG.tx_port_mode=='o')
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;	
	}
	else if(CFG.tx_port_mode=='p')
	{
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;	//默认
	}
	else
	{
		return(NULL);
	}
	
	//-----------------------------------------------------------------
	if(i=='5')
	{
		//通讯口5：TX,RX不在一个端口
		GPIO_Init(GPIOC, &GPIO_InitStructure);	//串口5 TX-PC12，RX-PD2
	}
	else
	{
		GPIO_Init(USART_GPIO, &GPIO_InitStructure);
	}
	//-----------------------------------------------------------------
	
	if(CFG.RS485_GPIO_BASE=='0')
	{
		p->RS485_GPIO_SEND=&p->RS485_SOFT;
		p->RS485_GPIO_RECV=&p->RS485_SOFT;
	}
	else if(CFG.RS485_GPIO_BASE >='a' && CFG.RS485_GPIO_BASE <='g')
	{
		RS485_GPIO_BASE=(GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE-GPIOA_BASE)*(CFG.RS485_GPIO_BASE-'a'));
		
		i=hexchar_btye(CFG.RS485_GPIO_PIN);
		if(i>=0)
		{	
			p->RS485_PIN=1 << i;
			GPIO_InitStructure.GPIO_Pin = p->RS485_PIN;
			if(CFG.RS485_PORT_MODE=='p')
			{
				GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;	//推挽输出
			}
			else if(CFG.RS485_PORT_MODE=='o')
			{
				GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;	//推挽输出
			}
			else
			{
				return(NULL);
			}
			GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//快速模式输出
			GPIO_Init(RS485_GPIO_BASE, &GPIO_InitStructure);
			
			if(CFG.RS485_GPIO_polarity=='+')
			{	//RS485高电平发送
				p->RS485_GPIO_SEND=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BSRR);
				p->RS485_GPIO_RECV=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BRR);
			}
			else if(CFG.RS485_GPIO_polarity=='-')
			{	//RS485低电平发送
				p->RS485_GPIO_SEND=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BRR);
				p->RS485_GPIO_RECV=(unsigned short *)&(((GPIO_TypeDef*)RS485_GPIO_BASE)->BSRR);
			}
			else
			{
				return(NULL);
			}
			*(p->RS485_GPIO_RECV)=p->RS485_PIN;		//初始化后切为接收状态
		}
		else
		{
			return(NULL);
		}
	}
	else
	{
		return(NULL);
	}
	
	
	//-------------------------------------------------------------------------
	if(CFG.hf_mode=='f')
	{
		p->sta |= 1<<B_USART_FD;				//全双工标志
	}
	else if(CFG.hf_mode != 'h')
	{
		return(NULL);
	}
	//-------------------------------------------------------------------------
	//初始化串行端口
	if(ulBaud==BAUD_USE_NB)
	{
		if(p->baud_nb>=BAUD_NB_MAX)p->baud_nb=0;
		ulBaud=Tb_BaudRate[p->baud_nb];
	}
	USART_InitStructure.USART_BaudRate = ulBaud;

	Set_Usart_Tout_1mS(p,ulBaud);
	//---------------------------------------------------------------------

	if(CFG.parity=='n')
	{
		i=USART_Parity_No;
	}
	else if(CFG.parity=='e')
	{
		i=USART_Parity_Even;
	}
	else if(CFG.parity=='o')
	{
		i=USART_Parity_Odd;
	}
	else
	{
		return(NULL);
	}
	
	USART_InitStructure.USART_Parity = i;
	
	if((CFG.data_bits == '8') &&  (CFG.parity=='n'))
	{
		i = USART_WordLength_8b;
	}
	else if(CFG.data_bits == '8')
	{
		i = USART_WordLength_9b;
	}
	else
	{
		return(NULL);
	}

	USART_InitStructure.USART_WordLength = i;
	
	if(CFG.stop_bits=='1')
	{
		i=USART_StopBits_1;
	}
	else if(CFG.stop_bits=='2')
	{
		i=USART_StopBits_2;
	}
	
	USART_InitStructure.USART_StopBits = i;
	

