ACantabile/OS/AppLib/STM32F10X_USART_FD.C
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	
	USART_Init(USART, &USART_InitStructure);	//配置端口
	USART_ITConfig(USART, USART_IT_RXNE, ENABLE);	//使能中断
	//-----------------------------------------------------------
	i=hexchar_btye(CFG.interrupt);
	if(i<0)
	{
		return(NULL);
	}
	
	//使能中断
	NVIC_InitStructure.NVIC_IRQChannel = USART_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = i;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	USART_Cmd(USART, ENABLE);	//使能端口
	//------------------------------------------------------------
	return(p);	
}

//-----------------------------------------------------------------------------------
void Set_Usart_Adr(USART_T *p,unsigned char adr)
{
	p->adr=adr;
}

void Set_Usart_BaudRate(USART_T *p,u32 BaudRate)
{
	u32 tmpreg = 0x00, apbclock = 0x00;
	u32 integerdivider = 0x00;
	u32 fractionaldivider = 0x00;
	//u32 usartxbase = 0;

	RCC_ClocksTypeDef RCC_ClocksStatus;
	USART_TypeDef* USARTx;

	//-------------------------------------------------------------------------------
	USARTx=(USART_TypeDef*)p->base;

	RCC_GetClocksFreq(&RCC_ClocksStatus);
	//if (usartxbase == USART1_BASE)
	if ((u32)USARTx == USART1_BASE)
	{
		apbclock = RCC_ClocksStatus.PCLK2_Frequency;
	}
	else
	{
		apbclock = RCC_ClocksStatus.PCLK1_Frequency;
	}
	
	// Determine the integer part
	//integerdivider = ((0x19 * apbclock) / (0x04 * (USART_InitStruct->USART_BaudRate)));
	integerdivider = ((0x19 * apbclock) / (0x04 * BaudRate));
	tmpreg = (integerdivider / 0x64) << 0x04;
	
	// Determine the fractional part
	fractionaldivider = integerdivider - (0x64 * (tmpreg >> 0x04));
	tmpreg |= ((((fractionaldivider * 0x10) + 0x32) / 0x64)) & ((u8)0x0F);
	
	// Write to USART BRR
	USARTx->BRR = (u16)tmpreg;
	//-------------------------------------------------------------------------------
	Set_Usart_Tout_1mS(p,BaudRate);
}
//-----------------------------------------------------------------------------------
#define AutoBaud_Retry_NB	4
u8 Usart_Auto_BaudRate(u8 comm_ret,USART_T *p)
{
	u8 r=0;

	if(!TstB(p->baud_sta,B_USART_BAUD_LOCK) && (comm_ret!=0))
	{//波特率没有锁定
		if(comm_ret==USART_REC_OK || comm_ret==USART_REC_FORMATOK)
		{//收到正确的格式包或不采用波特率自适应,锁定波特率
			U8_SetB(&(p->baud_sta),B_USART_BAUD_LOCK);
			Set_Usart_Tout_1mS(p,BAUD_USE_NB);
			r=1;
		}
		else
		{
			if(++p->baud_sta>AutoBaud_Retry_NB)
			{
				p->baud_sta=0;//cnt_1ms+p->baud_tout;
				if(++(p->baud_nb)>=BAUD_NB_MAX)
				{
					p->baud_nb=0;
				}
				Set_Usart_BaudRate(p,Tb_BaudRate[p->baud_nb]);
			}
		}	
	}
	return(r);	
}
//-----------------------------------------------------------------------------------
void Set_Usart_Tout_1mS(USART_T *p,u32 ulBaud)
{
	u32 j,k;

	if(ulBaud==BAUD_USE_NB)
	{
		ulBaud=Tb_BaudRate[p->baud_nb];
	}

	if(TstB(p->baud_sta,B_USART_BAUD_LOCK))
	{
		k=2;
		j=(u32)1000*4*11;	//(1/1mS)*4T*11B/BaudRate
	}	
	else
	{
		k=1;
		j=(u32)1000*3*11;	//(1/1mS)*3T*11B/BaudRate
	}

	j/=ulBaud;		

	if(j==0)
	{
		j++;
	}
	j+=k;	

	p->tm_1mS_init=j;
}
//----------------------------------------------------------------------------


unsigned int usart_copy_usart(USART_T *pd,USART_T *ps,unsigned char b_erase)
{
	unsigned int d_e,d_len,s_s,s_e,s_len;
	unsigned char *pdb,*psb; 
	unsigned int cnt=0;
	
	d_e=pd->t_e;
	d_len=pd->tx_buf_len;
	pdb=pd->tx_buf;
	s_s=ps->r_s;
	s_e=ps->r_e;
	s_len=ps->rx_buf_len;
	psb=ps->rx_buf;
	
	if(s_s!=s_e)
	{
	
		U8_SetB(&(pd->sta),B_USART_TX_BUSY);			//切换成忙状态
		HWREGH(pd->RS485_GPIO_SEND)=pd->RS485_PIN;		//RS485端口指向发送状态	
		
		while(s_s!=s_e)
		{
			pdb[d_e++]=psb[s_s++];
			s_s %= s_len;
			d_e %= d_len;
			cnt++;
		}
		
		if(b_erase)
		{
			ps->r_s=s_s;
		}
		pd->t_e=d_e;
		
		U32_SetB((unsigned long*)(pd->base+USART_CR1),B_USART_CR1_TXEIE);//允许TXE中断
	}
	return(cnt);
}


void USART1_IRQHandler(void)
{
	usart_isr(&g_USART[0]);	
}

void USART2_IRQHandler(void)
{
	usart_isr(&g_USART[1]);	
}

void USART3_IRQHandler(void)
{
	usart_isr(&g_USART[2]);	
}

#if USART_N > 3
void UART4_IRQHandler(void)
{
	usart_isr(&g_USART[3]);	
}

void UART5_IRQHandler(void)
{
	usart_isr(&g_USART[4]);	
}
#endif
